[
    {
        "titre": "Projet 1 - HTML & CSS",
        "langages": "HTML, CSS",
        "notions": "Respect du design d'une maquette / Utilisation de balises sémantiques / Responsive / Validation W3C",
        "imageURL": "/media/projet1.webp",
        "siteURL": "https://furax420.github.io/P1_Bookie/",
        "codeURL": "https://github.com/Furax420/premierProjet/tree/main",
        "description": "Ce projet consistait à fabriquer la partie Front-End d'un site de réservation d'hôtels en ligne. Étant le premier projet de la formation, les langages utilisés ont été HTML et CSS. À partir d'une maquette fournie par le client, j'ai recréé le site en partant de zéro, en respectant le design de la maquette. Le site devait également être responsive pour téléphone et tablette."
    },
    {
        "titre": "Projet 2 - JavaScript",
        "langages": "JavaScript, CSS",
        "notions": "Génération dynamique d'éléments / Log In avec stockage de token / Création de modal / Utilisation d'API",
        "imageURL": "/media/projet2.webp",
        "siteURL": "https://preeminent-tapioca-52a725.netlify.app/",
        "codeURL": "https://github.com/Furax420/P3_JS",
        "description": "Ce projet avait pour but de créer la partie front-end interactive d'un site d'architecte. La première étape a été de générer des boutons de filtres en fonction des catégories de photos postées par le client. Dans un second temps, j'ai mis en place un formulaire de Log In fonctionnel. Ensuite, j'ai créé un modal qui permet de visualiser et supprimer les photos déjà postées sur le site, ainsi qu'un autre modal qui permet de poster une nouvelle photo en renseignant un format d'image particulier, une taille maximale, un nom et une catégorie. Tout au long de ce projet, je me suis familiarisé avec l'utilisation de JavaScript et également les différents types de requêtes aux API."
    },
    {
        "titre": "Projet 3 - Gestion Agile",
        "langages": "HTML, CSS, JavaScript",
        "notions": "Gestion Agile / Sprint / Outils de Veille Technologique / Kanban via Notion",
        "imageURL": "/media/projet3.webp",
        "siteURL": "https://bedecked-digit-3f0.notion.site/6f4c39b29a2043bd8c608e6bb0d8c378?v=5c9cb6b3c23f4b479addc8e0be1b11d0",
        "codeURL": "",
        "description": "Durant ce projet, j'ai été chargé de préparer au mieux le développement d'un nouveau site de création de menu pour un client. J'ai d'abord configuré un outil de veille technologique pour me permettre de trouver de l'inspiration et me tenir informé sur le monde du développement et de la technologie. Ensuite, grâce aux Users Stories déterminées en amont, j'ai pu travailler sur une solution logique et cohérente pour les équipes de développeurs. J'ai également établi un tableau Kanban sur Notion qui regroupe les différentes tâches et leur état d'avancement."
    },
    {
        "titre": "Projet 4 - Débug / Accessibilité & SEO",
        "langages": "Essentiellement HTML (CSS pour quelques fixes et JavaScript pour la partie débug)",
        "notions": "SEO / Accessibilité / Débug / Balises Méta / Données Structurées / Chargement Différé",
        "imageURL": "/media/projet4.webp",
        "siteURL": "https://furax420.github.io/Projet5/",
        "codeURL": "https://github.com/Furax420/Projet5",
        "description": "Ce projet avait pour but de me sensibiliser aux performances, à l'accessibilité et au SEO sur un site de photographe. Il y a également eu une partie débug sur du code JavaScript qui ne fonctionnait pas correctement (Section Filtres et Flèche de navigation de modale non réactifs). Une grosse partie de l'optimisation des performances a porté sur le format des images et le chargement différé de certaines ressources. Enfin, l'optimisation du SEO m'a appris à utiliser diverses balises Meta, mais également des données structurées pour mieux influencer le référencement local."
    },
    {
        "titre": "Projet 5 - React",
        "langages": "React, CSS",
        "notions": "Composants React / React-Router / Props / Hook / Responsive",
        "imageURL": "/media/projet5.png",
        "siteURL": "https://majestic-cranachan-7327f6.netlify.app",
        "codeURL": "https://github.com/Furax420/projet6",
        "description": "Ce projet avait pour but d'apprendre l'utilisation de React et de ses composants, ainsi que React-Router. J'ai donc créé un site complet de locations immobilières comprenant une page d'accueil, une page À propos, une page détaillée pour chaque logement et enfin une page 404 pour toute URL inconnue. Ce projet m'a appris l'utilisation des composants React, des props et des différents hooks, ainsi que la bonne structure des dossiers d'un projet React. Le site final est entièrement responsive."
    },
    {
        "titre": "Projet 6 - Back-End",
        "langages": "Node.js / JavaScript / Express / MongoDB",
        "notions": "Création de serveur Express / Gestion de base de données MongoDB / Implémentation de l'authentification sécurisée / Développement d'une API RESTful",
        "imageURL": "/media/p6backend.png",
        "siteURL": "",
        "codeURL": "https://github.com/Furax420/P7backend",
        "description": "Le projet consiste en le développement du back-end pour \"Mon Vieux Grimoire\", un site de référencement et notation de livres pour une chaîne de librairies à Lille. Les enjeux comprennent la mise en place d'une API robuste et optimisée, en particulier pour la gestion et l'optimisation des images dans un contexte de développement écoresponsable. Le projet aborde aussi la gestion de fichiers utilisateur avec Multer et l'optimisation des images, la création de modèles de données, et le calcul dynamique de la note moyenne pour les livres notés."
    },
    {
        "titre": "Projet 7 - Ce Portfolio",
        "langages": "HTML, CSS, JavaScript",
        "notions": "HTML sémantique / CSS / Modal / Formulaire de contact PHP / Caroussel",
        "imageURL": "/media/projet7.webp",
        "siteURL": "",
        "codeURL": "https://github.com/Furax420/Portfolio",
        "description": "Le dernier projet de ma formation est le portfolio que vous consultez actuellement. J'ai utilisé une grande partie de ce que j'ai appris durant ma formation afin de créer un portfolio complet et qui me représente. Il représente l'aboutissement de mon travail en tant que jeune développeur web."
    }
]
